{"_path":"/white-papers/how-qa-factors-into-vc-due-diligence","_dir":"white-papers","_draft":false,"_partial":false,"_locale":"","title":"How Software QA Factors Into VC Investment Decisions","description":"Let your products shine bright with effective QA. With high interest rates and maturing SaaS markets, learn what is expected from founders at pre-seed to Series A stages of fundraising. With effective QA your product will impress customers and attract VC.","breadcrumbs":[{"name":"White papers","path":"/white-papers/"},{"name":"How QA factors into VC due diligence","path":"/white-papers/how-qa-factors-into-vc-due-diligence/"}],"link":"/white-papers/how-qa-factors-into-vc-due-diligence/","created":{"string":"May 30, 2024","valueOf":1717048800000,"month":"May","day":30,"year":2024},"shortDescription":"With high interest rates and maturing SaaS markets, learn what is expected from founders at pre-seed to Series A stages of fundraising. With effective QA your product will impress customers and attract VC.","body":{"type":"root","children":[{"type":"element","tag":"h2","props":{"id":"introduction"},"children":[{"type":"text","value":"Introduction"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In a recent market research survey we explored how venture capitalists (VCs) consider software quality in their investment decisions. We delved into their expectations for software quality at various investment stages and the standards for different products or verticals. The survey revealed that due to rising interest rates and increased consumer expectations for quality products, the investment landscape has become more stringent."}]},{"type":"element","tag":"blockquote","props":{},"children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I think there's less room for error overall in all aspects of raising capital. Today, there's a clear flight to quality at all levels, starting with capital being deployed to VC funds. With today's higher interest rates, there's significantly less capital going forward. — Frederico Santos, "},{"type":"element","tag":"a","props":{"href":"https://sg.linkedin.com/in/frederico-castro-santos-33874444","rel":["nofollow"]},"children":[{"type":"text","value":"VC Investor"}]}]}]},{"type":"element","tag":"h2","props":{"id":"evolution-of-the-startup-investment-landscape"},"children":[{"type":"text","value":"Evolution of the startup investment landscape"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"When you think of building a SaaS product, one of the most commonly quoted methodologies for managing product development is to \"Build fast and break things\" "},{"type":"element","tag":"a","props":{"href":"#references"},"children":[{"type":"text","value":"HBR"}]},{"type":"text","value":". But, this old wisdom applied to the early days of Facebook, from 2007 up to 2014 "},{"type":"element","tag":"a","props":{"href":"#references"},"children":[{"type":"text","value":"CNET"}]},{"type":"text","value":", may not be the best managerial choice while building up your product."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Today, we live in a high-interest environment where capital is much more cautious than in the years before us. In addition, we've collectively seen nearly $1.5T in investments in the past ten years "},{"type":"element","tag":"span","props":{},"children":[{"type":"text","value":"Statista"}]},{"type":"text","value":". This translates into a vast trove of well-made SaaS products and established brands."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"With this diversity of products, we live in a world where users are fluent in multiple software products. And with that, they now have higher expectations for what a functional software product looks like today. This can be true even in the early stages of startup products, at pre-seed or seed stages, depending on your product and team. As your startup matures, passing through Series A onwards, the expectations for quality only increase."}]},{"type":"element","tag":"h2","props":{"id":"how-does-software-quality-affect-investment-decisions"},"children":[{"type":"text","value":"How does Software Quality Affect Investment Decisions?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Our survey identified many types of startups that would significantly benefit from additional software QA. Investors use various questions to assess software quality requirements, such as:"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"How technical of a product is it/is the product deep tech?"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Is this an infrastructure product?"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Is the product expected to integrate with multiple other tools?"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Does the product function as middleware between other sets of tools?"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"How tolerant are customers of product failure?"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Are the customers technically savvy?"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Is the product responsible for Personally Identifiable Information (PII)?"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"What kind of regulatory environment does the product live in?"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Are there any legal or financial risks if the product fails or behaves erratically?"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ultimately, they are probing one fundamental question during due diligence:"}]},{"type":"element","tag":"blockquote","props":{},"children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"What are the risks when the product fails?"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"This is crucial because VCs are performing risk analysis on future software products while also assessing their market potential. If a product could be responsible for breaking a supply chain, crashing other software products due to downtime, enable fraud with stolen PII, pose security risks, or deterring non-technical users away from their product, this product will face extra scrutiny during due diligence."}]},{"type":"element","tag":"h3","props":{"id":"common-red-flags-during-vcs-due-diligence"},"children":[{"type":"text","value":"Common red flags during VC’s due diligence"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Our survey found several common red flags VCs look for during their due diligence process. These included not having a technical member on the founding team, usability and reliability issues, having a product that cannot scale with its current tech, and having a product with security vulnerabilities or other critical bugs. These red flags are particularly concerning for VCs if the product is deep tech or carries significant liabilities. Addressing these risks is vital for securing your next round of funding."}]},{"type":"element","tag":"h4","props":{"id":"usability-issues"},"children":[{"type":"text","value":"Usability issues­"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Usability problems were frequently mentioned red flags in our survey. Investors mentioned how clunky interfaces or poorly designed workflows often deterred them from investing in companies. Ensuring your software is user-friendly and intuitive is crucial to improving your investment prospects in this highly competitive environment."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Have you considered how often users may be multitasking while using your software? This is essential for many products because there's a good chance a non-technical person will be using your product. I can't tell you the number of times I've been in a doctor's office, bank, financial aid office, etc. where someone I speak with is using some kind of software while talking to me. If a simple mistake could create catastrophe for some customer, you need to invest time and effort into polishing your product's workflow."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Furthermore, you may be developing a product for non-technical users. These are people who would not be using your software unless it saved them a considerable amount of time. How patient do you think Joe the plumber will be when his dispatching software has awkward controls? This is true in several industries where users are much less tolerant of software problems."}]},{"type":"element","tag":"h4","props":{"id":"architectural-missteps-and-scaling-challenges"},"children":[{"type":"text","value":"Architectural missteps and scaling challenges"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Another red flag commonly mentioned by VCs were scaling issues. When raising capital your company will be expected to scale your number of customers. If your product requires a complete rewrite because you can't support enough customers or because of reliability issues, then you’ll likely be passed for investment. These problems create risks like"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Having a competitor come and scoop up your customers because of a superior product."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Customers litigating because you have legal or fiduciary responsibilities."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Dealing with reputational issues which will likely hamper future growth."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"These risks are substantial deterrents for investors and will likely lead them to pass up investing in your startup. I've spoken with investors who have declined investing in companies because technical due diligence failing. This was even the case when the company passed every other metric used during diligence with flying colors. This was undoubtedly disappointing for the founders, but could have been avoided with more focus on their underlying technology."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The one counterexample to this is when you're building a product prototype while identifying product-market fit. This exception is short-lived, and any startup should transition out as quickly as possible. You may have heard stories of founders successfully exiting with a product built using some no-code tool (like Bubble), but you should ensure such a tech decision is viable within your market. Also, you should have a plan for migrating off of such a platform so you can take control of your own tech."}]},{"type":"element","tag":"h4","props":{"id":"security-vulnerabilities-and-critical-bugs"},"children":[{"type":"text","value":"Security vulnerabilities and critical bugs"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Security issues were another prevalent red flag highlighted by survey participants. Many shared experiences of startups being rejected because of security concerns. This is a significant red flag for any company offering cybersecurity software, managing PII or financial data, or handling financial transactions. We've heard of companies trying to raise money that had bugs in their custom trading system that accidentally reversed positions for trades. Imagine shorting a stock and then having your position reversed by the trading platform to a put!"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Another story involved a cybersecurity company seeking funding. During due diligence, an analyst found numerous security vulnerabilities in their platform and managed to bypass their authentication into the admin dashboard. There the analyst left messages behind for the founders, leading to an embarrassing rejection from the VC."}]},{"type":"element","tag":"h3","props":{"id":"vc-expectations-at-pre-seed-and-seed-rounds"},"children":[{"type":"text","value":"VC expectations at pre-seed and seed rounds"}]},{"type":"element","tag":"quote","props":{":titles":"{\"titles\":[{\"title\": \"VC Investor\", \"link\": \"https://www.linkedin.com/in/frederic-gray-iv-637bba11\"}]}","image":"/img/white-papers/frederic-headshot.png","name":"Frederic Gray"},"children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Expectations for software quality are stage-specific. Earlier products should be simplistic, to learn customer needs, to drive future product iterations. Later products, Series A onwards, are held to a higher standard. That said, all these expectations are vertical-specific."}]}]},{"type":"element","tag":"h4","props":{"id":"feedback-from-non-technical-investors"},"children":[{"type":"text","value":"Feedback from non-technical investors"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In our discussions with investors, we found a range of responses regarding software quality in early-stage products at the pre-seed and seed stages of investment. The more non-technical investors we surveyed primarily focus their due diligence on"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Market potential."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"KPIs such as churn rate, CAC, MRR, etc."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"at these rounds. The main exceptions were deep tech products, products responsible for PII, or products with legal responsibilities. In these cases they would rely on tech consultants as part of their due diligence. Also, products in verticals requiring higher product quality faced additional scrutiny. In all these scenarios the bar is significantly higher, and founders should plan accordingly before seeking investments. In these cases investing in software quality is a major green flag for investors."}]},{"type":"element","tag":"h4","props":{"id":"feedback-from-technical-investors"},"children":[{"type":"text","value":"Feedback from technical investors"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"For technical investors, we received a range of answers. Many expected higher quality products and were more likely to dive deeper into the underlying tech used. Some green flags mentioned were"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Excellent architectural decisions for the software."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"A solid implementation roadmap, even if all features weren't yet available."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Adherence to best practices for software development, such as using agile management or Scrum."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"A solid foundation for scaling the product."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"High-quality API design and solid developer documentation."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The only reservations mentioned were founders who overengineered their product before fundraising. This could mean prematurely scaling a product without validating product-market fit, writing excessive tests for features that don't need them, and creating an inflexible infrastructure that doesn’t accomidate product changes. If you're in the early stages product development, there are many pitfalls for over-engineering. However, if product-market fit has been validated, then excellent software quality is highly rewarded."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"One notable example of this is Stripe "},{"type":"element","tag":"a","props":{"href":"#references"},"children":[{"type":"text","value":"Stripe"}]},{"type":"text","value":". When the company launched its first product, they were late to market with several competing payment platforms boasting large user bases. The key to Stripe's success was its excellent API design and high-quality infrastructure. Their product quality enabled them to secure funding successfully and continue to be an extremely successful company today."}]},{"type":"element","tag":"h3","props":{"id":"vc-expectations-at-series-a-and-beyond"},"children":[{"type":"text","value":"VC expectations at Series A and beyond"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Our surveys generally indicated that post-Series A, the bar for software quality significantly rises. At this stage you should be following best practices for software quality in your development process. This includes:"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Automated testing for core features and workflows."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Best practices for testing new features and using regression testing to prevent recurring bugs."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Following standard development methodologies such as agile, Scrum, etc."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Having testing infrastructure in place along with Continuous Integration (CI) and Continuous Deployment (CD)."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Documenting software architecture, main technical decisions, and any other relevant material."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Regular customer interaction to find pain points and other issues."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"At this stage, investors will substantially increase their scrutiny for any future series of investments. There is significantly less tolerance for failure, and investors will be looking for robust infrastructure in place."}]},{"type":"element","tag":"h2","props":{"id":"where-non-technical-founders-fall-short"},"children":[{"type":"text","value":"Where non-technical founders fall short"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The primary challenge non-technical founders face is exactly what's in their name: their lack of technical skills. If you, a non-technical founder, spend time learning about the core technical problems your startup faces in the future, investors will likely see this as a green flag. We've had investors tell us many non-technical founders value their ideas but don't understand the complexities of software, and hence cannot value the underlying technology. Some of these technical complexities include:"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Understanding how scalability impacts future growth."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Learning about the limitations of no-code platforms and how they are primarly for prototypes."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Educating yourself about the software development life cycle (SDLC)."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Understanding what software QA encompasses and how it looks in successful startups."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"You should ideally be prepared with a host of questions so you can build a bridge with your future technical co-founder. Without this bridge, you will be flying blind, creating unwanted risks for investors. It is paramount to have someone technical on your team as soon as possible; most VCs we've spoken with will refuse to invest in teams lacking this expertise."}]},{"type":"element","tag":"h3","props":{"id":"enhance-your-product-with-qacomet"},"children":[{"type":"text","value":"Enhance your product with QAComet"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"QAComet offers a wide variety of services to help you develop your product in line with your current investment round. With our fractional QA service, we can assist you in:"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Identifying and resolving usability issues."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Resolve usability problems in your no-code proptype."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Understanding technical content, providing support, and answering questions."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Conducting customer interviews for identifying customer pain points."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Establishing development workflows following Agile methodology."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Build a core testing suite when your business is ready for this acceleration."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"You can "},{"type":"element","tag":"a","props":{"href":"https://calendly.com/d/4nz-jp2-r35/initial-consultation-call","rel":["nofollow"]},"children":[{"type":"text","value":"schedule a free call today"}]},{"type":"text","value":" for a free 15-minute consultation to discuss your product's QA. We also offer a $50 two-week trial for early customers; ask us about it during our free consultation."}]},{"type":"element","tag":"h2","props":{"id":"challenges-for-technical-founders"},"children":[{"type":"text","value":"Challenges for technical founders"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Our VC survey participants noted some common issues technical founders face when developing their products. These include:"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Overbuilding and creating overengineered solutions."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Failing to identify the most crucial features and leaving the rest as part of the product roadmap."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Not engaging with customers and identifying their problems."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Not finding product-market fit quickly enough."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Each of these points requires a distinct mindset typically found among technical founders and can largely be fixed by communicating with customers within your market. Our survey revealed that it's more important to have solid implementations with partial feature support than to rattle off poorly implemented features."}]},{"type":"element","tag":"h3","props":{"id":"how-qacomet-helps-your-journey"},"children":[{"type":"text","value":"How QAComet helps your journey"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"QAComet offers a wide variety of services, helping you develop your product in line with your current investment round. With our fractional QA service, we can assist you in:"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Identifying usability issues and potential pain points."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Conducting customer interviews and pinpointing their problems and feature requirements."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Documenting core technical aspects, architectural decisions, and workflows."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Writing E2E, integration and unit tests."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Integrating automated tests with CI and building out CI pipelines."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Establishing your QA strategy as part of your Agile SDLC."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"You can "},{"type":"element","tag":"a","props":{"href":"https://calendly.com/d/4nz-jp2-r35/initial-consultation-call","rel":["nofollow"]},"children":[{"type":"text","value":"schedule a free call today"}]},{"type":"text","value":" for a free 15-minute consultation to talk about your product's QA. In addition, we offer a $50 two-week trial for early customers; ask us about it during our free consultation."}]},{"type":"element","tag":"h2","props":{"id":"take-your-startup-to-the-next-level"},"children":[{"type":"text","value":"Take your startup to the next level"}]},{"type":"element","tag":"quote","props":{":titles":"{\"titles\":[{\"title\": \"VC Partner\", \"link\": \"https://www.thinkklabs.com/\"}, {\"title\":\"4x Founder\", \"link\": \"https://www.linkedin.com/in/yianni-kellis/\"}]}","image":"/img/white-papers/yianni-headshot.png","name":"Yianni Kellis"},"children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Startups that have a clear emphasis on quality software development and thorough QA processes often secure funding more smoothly. These companies don't necessarily need large in-house QA teams but must demonstrate a strategic approach to maintaining software quality, possibly through fractional QA services."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The key takeaway from our survey is that expectations for product quality are here to stay. In our current startup environment, VCs expects more from founders due to the increase in quality tooling and heightened market expectations for usable products. It's paramount for both technical and non-technical founders to learn from their customers, build a solid user experience, and make sure their product meets customer expectations. Today, we live with higher expectations from customers and VCs alike, and startups must adapt to this evolving market."}]},{"type":"element","tag":"h2","props":{"id":"references"},"children":[{"type":"text","value":"References"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"[CNET] "},{"type":"element","tag":"a","props":{"href":"https://www.cnet.com/tech/mobile/zuckerberg-move-fast-and-break-things-isnt-how-we-operate-anymore/","rel":["nofollow"]},"children":[{"type":"text","value":"Zuckerberg: 'Move fast and break things' isn't how Facebook operates anymore"}]},{"type":"text","value":". CNET.com."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"[HBR] "},{"type":"element","tag":"a","props":{"href":"https://hbr.org/2019/01/the-era-of-move-fast-and-break-things-is-over","rel":["nofollow"]},"children":[{"type":"text","value":"The Era of “Move Fast and Break Things” Is Over"}]},{"type":"text","value":". Harvard Business Review."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"[Notion] "},{"type":"element","tag":"a","props":{"href":"https://www.figma.com/blog/design-on-a-deadline-how-notion-pulled-itself-back-from-the-brink-of-failure/","rel":["nofollow"]},"children":[{"type":"text","value":"Design on a deadline: How Notion pulled itself back from the brink of failure"}]},{"type":"text","value":". Figma Blog."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"[Statista] "},{"type":"element","tag":"a","props":{"href":"https://www.statista.com/statistics/277501/venture-capital-amount-invested-in-the-united-states-since-1995/","rel":["nofollow"]},"children":[{"type":"text","value":"Value of venture capital investment in the United States from 2006 to 2022"}]},{"type":"text","value":". Statista.com."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"[Stripe] "},{"type":"element","tag":"a","props":{"href":"https://www.inc.com/jason-aten/the-5-simple-reasons-stripe-became-most-valuable-startup-ever.html","rel":["nofollow"]},"children":[{"type":"text","value":"The 5 Simple Reasons Stripe Became the Most Valuable Startup Ever"}]},{"type":"text","value":". Inc."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"[Techcrunch] "},{"type":"element","tag":"a","props":{"href":"https://techcrunch.com/2024/01/10/venture-capital-2023-analysis/","rel":["nofollow"]},"children":[{"type":"text","value":"Explained in 5 charts: Venture capital in 2023"}]},{"type":"text","value":". Techcrunch."}]}]},{"type":"element","tag":"h3","props":{"id":"additional-resources"},"children":[{"type":"text","value":"Additional Resources"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://books.google.com/books?id=XLxUBQAAQBAJ","rel":["nofollow"]},"children":[{"type":"text","value":"Learning Agile: Understanding Scrum, XP, Lean, and Kanban"}]}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://www.amazon.com/Agile-Testing-Practical-Guide-Testers/dp/0321534468/","rel":["nofollow"]},"children":[{"type":"text","value":"Agile Testing: A Practical Guide for Testers and Agile Teams"}]}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://www.scrum.org/resources/blog/yds-where-does-quality-assurance-qa-fit-scrum-team","rel":["nofollow"]},"children":[{"type":"text","value":"YDS: Where Does Quality Assurance (QA) Fit on a Scrum Team?"}]}]}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"introduction","depth":2,"text":"Introduction"},{"id":"evolution-of-the-startup-investment-landscape","depth":2,"text":"Evolution of the startup investment landscape"},{"id":"how-does-software-quality-affect-investment-decisions","depth":2,"text":"How does Software Quality Affect Investment Decisions?","children":[{"id":"common-red-flags-during-vcs-due-diligence","depth":3,"text":"Common red flags during VC’s due diligence"},{"id":"vc-expectations-at-pre-seed-and-seed-rounds","depth":3,"text":"VC expectations at pre-seed and seed rounds"},{"id":"vc-expectations-at-series-a-and-beyond","depth":3,"text":"VC expectations at Series A and beyond"}]},{"id":"where-non-technical-founders-fall-short","depth":2,"text":"Where non-technical founders fall short","children":[{"id":"enhance-your-product-with-qacomet","depth":3,"text":"Enhance your product with QAComet"}]},{"id":"challenges-for-technical-founders","depth":2,"text":"Challenges for technical founders","children":[{"id":"how-qacomet-helps-your-journey","depth":3,"text":"How QAComet helps your journey"}]},{"id":"take-your-startup-to-the-next-level","depth":2,"text":"Take your startup to the next level"},{"id":"references","depth":2,"text":"References","children":[{"id":"additional-resources","depth":3,"text":"Additional Resources"}]}]}},"_type":"markdown","_id":"content:white-papers:how-qa-factors-into-vc-due-diligence.md","_source":"content","_file":"white-papers/how-qa-factors-into-vc-due-diligence.md","_extension":"md"}